RT-Thread/rt-thread/bsp/n32g452xx/Libraries/rt_drivers/drv_can.c
/*
 * Copyright (c) 2006-2022, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2022-01-09     chenbin      the first version
 */

#include "drv_can.h"
#ifdef BSP_USING_CAN

#include "stdint.h"
#include "n32g45x.h"
#include "n32g45x_can.h"

struct n32g45x_baud_rate_tab
{
    uint32_t baud_rate;
    uint16_t PRESCALE;
    uint8_t RSJW;
    uint8_t TBS1;
    uint8_t TBS2;
    uint8_t notused;
};

#define N32_CAN_BAUD_DEF(rate, rsjw, tbs1, tbs2, prescale) \
    {                                                      \
        .baud_rate = rate,                                 \
        .RSJW = rsjw,                                      \
        .TBS1 = tbs1,                                      \
        .TBS2 = tbs2,                                      \
        .PRESCALE = prescale                               \
    }

/* N32G45x can device */
struct n32g45x_can
{
    char *name;
    CAN_Module *CANx;
    CAN_InitType can_init;
    CAN_FilterInitType can_filter_init;
    struct rt_can_device device; /* inherit from can device */
};

#define LOG_TAG "drv_can"
#include <drv_log.h>

/*
* N32G45x CAN1 CAN2 used APB1 (36MHz)
* baud calculation example:  baud =  Tclk / ((ss + bs1 + bs2) * brp)
* 36MHz / ((1 + 5 + 3) * 4) = 1MHz
*/
#if defined(N32G45X) /* APB1 36MHz(max) */
static const struct n32g45x_baud_rate_tab can_baud_rate_tab[] =
    {
        N32_CAN_BAUD_DEF(CAN1MBaud, CAN_RSJW_1tq, CAN_TBS1_5tq, CAN_TBS2_3tq, 4),
        N32_CAN_BAUD_DEF(CAN800kBaud, CAN_RSJW_1tq, CAN_TBS1_5tq, CAN_TBS2_3tq, 5),
        N32_CAN_BAUD_DEF(CAN500kBaud, CAN_RSJW_1tq, CAN_TBS1_5tq, CAN_TBS2_3tq, 8),
        N32_CAN_BAUD_DEF(CAN250kBaud, CAN_RSJW_1tq, CAN_TBS1_5tq, CAN_TBS2_3tq, 16),
        N32_CAN_BAUD_DEF(CAN125kBaud, CAN_RSJW_1tq, CAN_TBS1_5tq, CAN_TBS2_3tq, 32),
        N32_CAN_BAUD_DEF(CAN100kBaud, CAN_RSJW_2tq, CAN_TBS1_8tq, CAN_TBS2_8tq, 20),
        N32_CAN_BAUD_DEF(CAN50kBaud, CAN_RSJW_2tq, CAN_TBS1_8tq, CAN_TBS2_8tq, 40),
        N32_CAN_BAUD_DEF(CAN20kBaud, CAN_RSJW_2tq, CAN_TBS1_8tq, CAN_TBS2_8tq, 80),
        N32_CAN_BAUD_DEF(CAN10kBaud, CAN_RSJW_2tq, CAN_TBS1_8tq, CAN_TBS2_8tq, 160),
};
#endif

#ifdef BSP_USING_CAN1
static struct n32g45x_can drv_can1 =
    {
        .name = "can1",
        .CANx = CAN1,
};
#endif

#ifdef BSP_USING_CAN2
static struct n32g45x_can drv_can2 =
    {
        .name = "can2",
        .CANx = CAN2,
};
#endif

static uint32_t get_can_baud_index(rt_uint32_t baud)
{
    uint32_t len, index;

    len = sizeof(can_baud_rate_tab) / sizeof(can_baud_rate_tab[0]);
    for (index = 0; index < len; index++)
    {
        if (can_baud_rate_tab[index].baud_rate == baud)
            return index;
    }
    return 0; /* default baud is CAN1MBaud */
}

static uint8_t get_can_mode_rtt2n32(uint8_t rtt_can_mode)
{
    uint8_t mode = CAN_Normal_Mode;
    switch (rtt_can_mode)
    {
    case RT_CAN_MODE_NORMAL:
        mode = CAN_Normal_Mode;
        break;
    case RT_CAN_MODE_LISEN:
        mode = CAN_Silent_Mode;
        break;
    case RT_CAN_MODE_LOOPBACK:
        mode = CAN_LoopBack_Mode;
        break;
    case RT_CAN_MODE_LOOPBACKANLISEN:
        mode = CAN_Silent_LoopBack_Mode;
        break;
    }
    return mode;
}

static rt_err_t _can_filter_config(struct n32g45x_can *drv_can)
{
    if (drv_can->CANx == CAN1)
    {
        CAN1_InitFilter(&(drv_can->can_filter_init));
    }
#ifdef CAN2
    else if (drv_can->CANx == CAN2)
    {
        CAN2_InitFilter(&(drv_can->can_filter_init));
    }
#endif
    else
    {
        rt_kprintf("can filter config error\n");
        return -RT_EINVAL;
    }
    return RT_EOK;
}

static rt_err_t _can_config(struct rt_can_device *can, struct can_configure *cfg)
{
    struct n32g45x_can *drv_can;
    rt_uint32_t baud_index;

    RT_ASSERT(can);
    RT_ASSERT(cfg);
    drv_can = (struct n32g45x_can *)can->parent.user_data;
    RT_ASSERT(drv_can);

    /* Configure CAN1 and CAN2 */
    if (drv_can->CANx == CAN1)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_CAN1, ENABLE);
        n32_msp_can_init(CAN1);
    }
#ifdef CAN2
    else if (drv_can->CANx == CAN2)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_CAN2, ENABLE);
        n32_msp_can_init(CAN2);
    }
#endif
    else
    {
        rt_kprintf("can init error1\n");
        return -RT_EINVAL;
    }
    /* Struct init*/
    CAN_InitStruct(&(drv_can->can_init));

    drv_can->can_init.TTCM = DISABLE;
    drv_can->can_init.ABOM = DISABLE;
    drv_can->can_init.AWKUM = DISABLE;
    drv_can->can_init.NART = DISABLE;
    drv_can->can_init.RFLM = DISABLE;
    drv_can->can_init.TXFP = ENABLE;

    //mode
    drv_can->can_init.OperatingMode = get_can_mode_rtt2n32(cfg->mode);

    //baud
    baud_index = get_can_baud_index(cfg->baud_rate);
    drv_can->can_init.RSJW = can_baud_rate_tab[baud_index].RSJW;
    drv_can->can_init.TBS1 = can_baud_rate_tab[baud_index].TBS1;
    drv_can->can_init.TBS2 = can_baud_rate_tab[baud_index].TBS2;
    drv_can->can_init.BaudRatePrescaler = can_baud_rate_tab[baud_index].PRESCALE;

    /* init can */
    if (CAN_Init(drv_can->CANx, &(drv_can->can_init)) != CAN_InitSTS_Success)
    {
        rt_kprintf("can init error2\n");
        return -RT_ERROR;
    }
    /* default filter config */
    _can_filter_config(drv_can);
    return RT_EOK;
}

#ifndef CAN1_TX_IRQn
#define CAN1_TX_IRQn USB_HP_CAN1_TX_IRQn
#endif

#ifndef CAN1_RX0_IRQn
#define CAN1_RX0_IRQn USB_LP_CAN1_RX0_IRQn
#endif

static rt_err_t _can_control(struct rt_can_device *can, int cmd, void *arg)
{
    rt_uint32_t argval;
    struct n32g45x_can *drv_can;
    struct rt_can_filter_config *filter_cfg;

    RT_ASSERT(can != RT_NULL);
    drv_can = (struct n32g45x_can *)can->parent.user_data;
    RT_ASSERT(drv_can != RT_NULL);

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        argval = (rt_uint32_t)arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            if (CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN1_RX0_IRQn);
                NVIC_DisableIRQ(CAN1_RX1_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_RX0_IRQn);
                NVIC_DisableIRQ(CAN2_RX1_IRQn);
            }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP0, DISABLE); /*!< DATFIFO 0 message pending Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF0, DISABLE);  /*!< DATFIFO 0 full Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV0, DISABLE); /*!< DATFIFO 0 overrun Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP1, DISABLE); /*!< DATFIFO 1 message pending Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF1, DISABLE);  /*!< DATFIFO 1 full Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV1, DISABLE); /*!< DATFIFO 1 overrun Interrupt*/
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            if (CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN1_TX_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_TX_IRQn);
            }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_TME, DISABLE); /*!< Transmit mailbox empty Interrupt*/
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            if (CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN1_SCE_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_SCE_IRQn);
            }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_EWG, DISABLE); /*!< Error warning Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_EPV, DISABLE); /*!< Error passive Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_BOF, DISABLE); /*!< Bus-off Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_LEC, DISABLE); /*!< Last error code Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_ERR, DISABLE); /*!< Error Interrupt*/
        }
        break;
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t)arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP0, ENABLE); /*!< DATFIFO 0 message pending Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF0, ENABLE);  /*!< DATFIFO 0 full Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV0, ENABLE); /*!< DATFIFO 0 overrun Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP1, ENABLE); /*!< DATFIFO 1 message pending Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF1, ENABLE);  /*!< DATFIFO 1 full Interrupt*/
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV1, ENABLE); /*!< DATFIFO 1 overrun Interrupt*/

