RT-Thread/rt-thread/bsp/n32g452xx/Libraries/rt_drivers/drv_can.c
#ifdef BSP_USING_CAN1
/**
 * @brief This function handles CAN1 TX interrupts. transmit fifo0/1/2 is empty can trigger this interrupt
 */
#define CAN1_TX_IRQHandler USB_HP_CAN1_TX_IRQHandler
void CAN1_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM0))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x00 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM0);
    }
    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM1))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x01 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM1);
    }
    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM2))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x02 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM2);
    }
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX0 interrupts.
 */
#define CAN1_RX0_IRQHandler USB_LP_CAN1_RX0_IRQHandler
void CAN1_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can1.device, CAN_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX1 interrupts.
 */
void CAN1_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can1.device, CAN_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 SCE interrupts.
 */
void CAN1_SCE_IRQHandler(void)
{
    uint32_t errtype;
    rt_interrupt_enter();

    if (CAN_GetIntStatus(drv_can1.CANx, CAN_INT_ERR))
    {
        errtype = drv_can1.CANx->ESTS;
        // ESTS -> LEC
        switch ((errtype & 0x70) >> 4)
        {
        case RT_CAN_BUS_BIT_PAD_ERR:
            break;
        case RT_CAN_BUS_FORMAT_ERR:
            drv_can1.device.status.formaterrcnt++;
            break;
        case RT_CAN_BUS_ACK_ERR: /* attention !!! test ack err's unit is transmit unit */
            drv_can1.device.status.ackerrcnt++;
            if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM0))
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
            else if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM1))
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
            else if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM2))
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
            break;
        case RT_CAN_BUS_IMPLICIT_BIT_ERR:
        case RT_CAN_BUS_EXPLICIT_BIT_ERR:
            drv_can1.device.status.biterrcnt++;
            break;
        case RT_CAN_BUS_CRC_ERR:
            drv_can1.device.status.crcerrcnt++;
            break;
        }
        drv_can1.device.status.lasterrtype = errtype & 0x70;
        drv_can1.device.status.rcverrcnt = errtype >> 24;
        drv_can1.device.status.snderrcnt = (errtype >> 16 & 0xFF);
        drv_can1.device.status.errcode = errtype & 0x07;

        CAN_ClearINTPendingBit(drv_can1.CANx, CAN_INT_ERR);
    }
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN1 */

#ifdef BSP_USING_CAN2
/**
 * @brief This function handles CAN2 TX interrupts.
 */
void CAN2_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM0))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM0);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x00 << 8));
    }
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM1))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM1);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x01 << 8));
    }
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM2))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM2);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x02 << 8));
    }
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN2 RX0 interrupts.
 */
void CAN2_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can2.device, CAN_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN2 RX1 interrupts.
 */
void CAN2_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can2.device, CAN_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN2 SCE interrupts.
 */
void CAN2_SCE_IRQHandler(void)
{
    uint32_t errtype;
    rt_interrupt_enter();

    if (CAN_GetIntStatus(drv_can2.CANx, CAN_INT_ERR))
    {
        errtype = drv_can2.CANx->ESTS;
        // ESTS -> LEC
        switch ((errtype & 0x70) >> 4)
        {
        case RT_CAN_BUS_BIT_PAD_ERR:
            break;
        case RT_CAN_BUS_FORMAT_ERR:
            drv_can2.device.status.formaterrcnt++;
            break;
        case RT_CAN_BUS_ACK_ERR: /* attention !!! test ack err's unit is transmit unit */
            drv_can2.device.status.ackerrcnt++;
            if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM0))
                rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
            else if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM1))
                rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
            else if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM2))
                rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
            break;
        case RT_CAN_BUS_IMPLICIT_BIT_ERR:
        case RT_CAN_BUS_EXPLICIT_BIT_ERR:
            drv_can2.device.status.biterrcnt++;
            break;
        case RT_CAN_BUS_CRC_ERR:
            drv_can2.device.status.crcerrcnt++;
            break;
        }

        drv_can2.device.status.lasterrtype = errtype & 0x70;
        drv_can2.device.status.rcverrcnt = errtype >> 24;
        drv_can2.device.status.snderrcnt = (errtype >> 16 & 0xFF);
        drv_can2.device.status.errcode = errtype & 0x07;

        CAN_ClearINTPendingBit(drv_can2.CANx, CAN_INT_ERR);
    }
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN2 */

int rt_hw_can_init(void)
{
    struct can_configure config = CANDEFAULTCONFIG;
    config.privmode = RT_CAN_MODE_NOPRIV;
    config.ticks = 50;
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 14;
#ifdef CAN2
    config.maxhdr = 28;
#endif
#endif

