RT-Thread/rt-thread/bsp/n32g452xx/Libraries/rt_drivers/drv_can.c
#ifdef BSP_USING_CAN1
    /* config default filter */
    drv_can1.can_filter_init.Filter_Num = 0;
    drv_can1.can_filter_init.Filter_Mode = CAN_Filter_IdMaskMode;
    drv_can1.can_filter_init.Filter_Scale = CAN_Filter_32bitScale;
    drv_can1.can_filter_init.Filter_HighId = 0x0000;
    drv_can1.can_filter_init.Filter_LowId = 0x0000;
    drv_can1.can_filter_init.FilterMask_HighId = 0;
    drv_can1.can_filter_init.FilterMask_LowId = 0;
    drv_can1.can_filter_init.Filter_FIFOAssignment = CAN_FIFO0;
    drv_can1.can_filter_init.Filter_Act = ENABLE;
    drv_can1.device.config = config;
    /* register CAN1 device */
    rt_hw_can_register(&drv_can1.device, drv_can1.name, &_can_ops, &drv_can1);
#endif /* BSP_USING_CAN1 */

#ifdef BSP_USING_CAN2
    /* config default filter */
    drv_can2.can_filter_init.Filter_Num = 0;
    drv_can2.can_filter_init.Filter_Mode = CAN_Filter_IdMaskMode;
    drv_can2.can_filter_init.Filter_Scale = CAN_Filter_32bitScale;
    drv_can2.can_filter_init.Filter_HighId = 0x0000;
    drv_can2.can_filter_init.Filter_LowId = 0x0000;
    drv_can2.can_filter_init.FilterMask_HighId = 0;
    drv_can2.can_filter_init.FilterMask_LowId = 0;
    drv_can2.can_filter_init.Filter_FIFOAssignment = CAN_FIFO0;
    drv_can2.can_filter_init.Filter_Act = ENABLE;
    drv_can2.device.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&drv_can2.device, drv_can2.name, &_can_ops, &drv_can2);
#endif /* BSP_USING_CAN2 */

    return 0;
}

INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* BSP_USING_CAN */

/************************** end of file ******************/
